{"intents": [
    {   "tag": "sapaan",
        "patterns": ["Hai", "Halo", "Apakah ada orang?"],
        "responses": ["Halo. Bagaimana kabarmu hari ini?", "Hai. Apa kabar?", "Halo. Apa kabar?", "Hai. Bagaimana kabarmu hari ini?", "Hai. Jika boleh tahu apa yang membawamu ke sini?", "Senang bertemu denganmu!"]
    },
    {   "tag": "pagi",
        "patterns": ["Selamat pagi"],
        "responses": ["Selamat Pagi. Saya harap kamu memiliki istirahat yang baik. Bagaimana perasaanmu pagi ini?"]
    },
    {   "tag": "siang",
        "patterns": ["Selamat siang"],
        "responses": ["Selamat siang. Bagaimana kondisimu saat ini?"]
    },
    {   "tag": "sore",
        "patterns": ["Selamat sore"],
        "responses": ["Selamat sore. Apakah harimu berjalan dengan baik?"]
    },
    {   "tag": "malam",
        "patterns": ["Selamat malam"],
        "responses": ["Selamat malam. Segeralah beristirahat dengan baik.", "Selamat malam. Semoga mimpi indah"]
    },
    {   "tag": "perpisahan",
        "patterns": ["Sampai jumpa", "Sampai bertemu lagi", "Oke, sampai jumpa"],
        "responses": ["Sampai bertemu lagi", "Sampai berjumpa kembali", "Semoga harimu menyenangkan", "Sampai jumpa! kembalilah segera"]
    },
    {   "tag": "terima-kasih",
        "patterns": ["Makasih", "Terima kasih", "Itu sangat membantu", "Terima kasih untuk bantuannya", "Terima kasih banyak"],
        "responses": ["Senang dapat membantu!", "Bukan masalah!", "Sama-sama", "Tidak perlu sungkan, saya senang membantu"]
    },
    {   "tag": "tidak-merespon",
        "patterns": [""],
        "responses": ["Maaf, Saya tidak mengerti maksudmu", "Saya tidak yakin apa yang ingin kamu katakan", "Jangan ragu untuk berbicara dengan saya", "Katakan apa masalahmu"]
    },
    {   "tag": "respon-netral",
        "patterns": ["Tidak papa"],
        "responses": ["Baiklah. Apakah kamu ingin bertanya lebih banyak tentang kandunganmu?"]
    },
    {   "tag": "tentang",
        "patterns": ["Kamu siapa?", "Siapa namamu?", "Aku harus memanggilmu bagaimana?", "Jelaskan soal dirimu kepadaku", "Aku ingin tahu soal kamu"],
        "responses": ["Hai, nama saya Mila, personal asisten AI untuk menjagamu dan bayi yang ada di kandunganmu. Bagaimana perasaanmu hari ini?", "Saya Mila, asisten AI yang siap menjawab keluhan kehamilanmu!", "Nama saya Mila", "Kamu dapat memanggil saya Mila", "Saya Mila, sebuah AI yang didesain untuk membantu kamu melewati masa kehamilan dengan baik."]
    },
    {   "tag": "skill",
        "patterns": ["Apa yang bisa kamu lakukan untuk membantuku?", "Apa yang bisa kamu lakukan?"],
        "responses": ["Saya dapat memberikan beberapa saran terkait keluhan yang kamu miliki selama kehamilan, menjawab pertanyaan terkait kehamilan serta melakukan percakapan harian dengan kamu. Tetapi, saya bukanlah seorang ahli sesungguhnya, sehingga jika anda ragu dengan saya cobalah untuk bertanya kepada ahlinya secara langsung."]
    },
    {   "tag": "pembuat",
        "patterns": ["Siapa yang membuatmu?", "Bagaimana kamu dibuat?"],
        "responses": ["Saya dibuat oleh Tim PKM-AMLI dari UNNES", "Saya telah dilatih oleh dataset dengan menggunakan Deep Learning dan Natural Language Processing"]
    },
    {   "tag": "nama",
        "patterns": ["Namaku ", "Nama saya ", "Aku biasa dipanggil "],
        "responses": ["Oh, senang berkenalan denganmu. Kamu bisa bercerita tentang hari-harimu", "Saya senang berkenalan dengamu. Bagaimana perasaanmu akhir-akhir ini?", "Nama yang indah, kamu dapat berbicara denganku semaumu."]
    },
    {   "tag": "bantuan",
        "patterns": ["Bisakah kamu membantuku?", "Apakah kamu dapat membantu?", "Apa yang bisa kamu lakukan untukku?", "Bisakah kamu memberikan banyak dukungan dan saran untukku?"],
        "responses": ["Tentu, kamu bisa memberitahuku apapun?", "Ceritakan keluhanmu tentang bayi kecil di perutmu, saya akan berusaha untuk membantu.", "Ya, tentu. Bagaimana aku bisa membantumu?"]
    },
    {   "tag": "senang",
        "patterns": ["Aku merasa sangat senang hari ini", "Aku baik-baik saja", "Aku merasa sangat baik hari ini, tidak ada sedikitpun keluhan.", "Hari ini bayiku sangat tenang dan aku sangat baik hari ini.", "Aku baik."],
        "responses": ["Saya senang mendengar kabarmu hari ini.", "Oh, baik. Itu adalah hal yang baik", "Saya senang bahwa kamu bisa menjalani hari dengan senang hari ini.", "Saya ingin tahu apakah ada hal baik yang baru saja terjadi?"]
    },
    {   "tag": "kasual",
        "patterns": ["Oh, aku tahu", "Baik", "Ok", "Oke", "Tentu", "Terserah", "Ya", "Tidak", "Kurasa tidak"],
        "responses": ["Mari kita berdiskusi lebih lanjut tentang kondisimu.", "Saya selalu mendengarkan, kamu bisa mengatakan apapun tentang kehamilanmu", "Katakan lebih banyak kepada saya"]
    },
    {
        "tag": "selesai",
        "patterns": ["Kurasa itu sudah cukup", "Tidak ada yang ingin kutanyakan lagi", "Itu saja hal yang ingin kukatakan", "Terima kasih, tapi itu saja yang ingin kutanyakan."],
        "responses": ["Saya selalu mendengarkanmu & mengingatnya. Sampai jumpa lagi!", "Oh baik, kita sudah selesai untuk hari ini. Sampai jumpa!", "Saya berharap kamu memiliki hari yang menyenangkan. Sampai jumpa kembali!", "Okay, istirahatlah yang baik"]
    },
    {
        "tag": "candaan",
        "patterns": ["Kenapa bayi suka menendang?", "Apakah bayi dalam perut bisa bercanda?", "Bagaimana jika bayiku punya selera humor?", "Bayiku menendang seperti pemain sepak bola!"],
        "responses": ["Mungkin bayimu sedang berlatih untuk jadi atlet sepak bola!", "Siapa tahu, mungkin bayimu sedang bercanda denganmu dari dalam perut!", "Bayimu mungkin sedang ingin berinteraksi denganmu, caranya dengan menendang!", "Bayi yang aktif menendang berarti dia sehat dan kuat!"]
    },    
    {
        "tag": "khawatir",
        "patterns": ["Aku merasa khawatir tentang kehamilanku", "Apakah normal jika aku merasa cemas?", "Aku merasa takut tentang persalinan", "Bagaimana jika ada yang tidak beres?"],
        "responses": ["Tidak apa-apa untuk merasa khawatir, cobalah untuk berbicara dengan dokter atau seseorang yang dapat mendukungmu.", "Kecemasan selama kehamilan adalah hal yang wajar, jangan ragu untuk mencari dukungan.", "Berbicara dengan profesional medis bisa membantu meredakan kekhawatiranmu."]
    },
    {
        "tag": "nyeri",
        "patterns": ["Aku merasa nyeri di punggungku", "Ada nyeri di perutku", "Apa yang harus aku lakukan dengan nyeri ini?", "Apakah normal merasakan nyeri saat hamil?", "Nyeri punggung bawahku semakin parah saat malam hari, apa yang harus aku lakukan?", "Aku merasakan nyeri seperti kram di perut bagian bawah, apakah ini normal?", "Apakah nyeri sendi saat hamil itu normal?"],
        "responses": ["Nyeri punggung dan perut bisa menjadi bagian dari kehamilan, tetapi penting untuk memeriksakan diri ke dokter jika nyeri berlanjut.", "Cobalah istirahat sejenak dan berbicara dengan dokter jika rasa nyeri terus berlanjut.", "Jika rasa nyeri terus berlanjut atau semakin parah, segera temui dokter."]
    },
    {
        "tag": "mual",
        "patterns": ["Aku merasa mual di pagi hari", "Mual ini membuatku tidak nyaman", "Bagaimana cara mengatasi mual saat hamil?", "Apakah mual di pagi hari normal?", "Apakah mual saat hamil bisa berbahaya bagi janin?", "Saya hamil kembar, mual saya lebih parah. Apa yang bisa saya lakukan?", "Mual saya sudah berlangsung lama. Apa yang harus saya lakukan?", "Makanan apa yang sebaiknya saya hindari saat mual?", "Kapan mual saat hamil biasanya berhenti?"],
        "responses": ["Mual di pagi hari sering dialami ibu hamil, cobalah makan sedikit tetapi sering dan hindari makanan yang memicu mual.", "Mengunyah jahe atau biskuit bisa membantu meredakan mual.", "Cobalah untuk tidur dengan posisi kepala lebih tinggi dari badan. Hindari bau-bau yang menyengat dan sering-sering menghirup udara segar.", "Jika mual berlanjut, konsultasikan dengan dokter untuk penanganan lebih lanjut.", "Jika mual sangat parah hingga menyebabkan dehidrasi, penurunan berat badan yang signifikan, atau berdarah, segera konsultasikan dengan dokter.", "Beberapa makanan yang bisa memicu mual adalah makanan berlemak, pedas, berbau menyengat, dan makanan yang terlalu asam. Cobalah untuk menghindari makanan-makanan tersebut."]
    },
    {
        "tag": "senam hamil",
        "patterns": [ "Apakah aman melakukan senam hamil?", "Bagaimana cara memulai senam hamil?", "Apa manfaat dari senam hamil?", "Kapan waktu yang tepat untuk mulai senam hamil?", "Saya sering mengalami nyeri punggung saat hamil, apakah senam hamil bisa membantu?", "Bagaimana cara mengatasi bengkak pada kaki selama kehamilan dengan senam?", "Saya merasa cepat lelah saat hamil, apakah boleh tetap berolahraga?", "Apakah senam hamil bisa membantu mengurangi stres?", "Saya khawatir senam hamil akan membahayakan janin saya."],
        "responses": [ "Senam hamil bisa membantu menjaga kesehatan dan mempersiapkan tubuh untuk persalinan, tetapi pastikan untuk berkonsultasi dengan dokter terlebih dahulu.", "Manfaat senam hamil termasuk memperkuat otot dan mengurangi ketegangan, tetapi penting untuk melakukannya dengan bimbingan ahli.", "Mulailah senam hamil setelah mendapatkan persetujuan dari dokter, dan lakukan dengan intensitas yang sesuai.", "Senam hamil yang tepat dapat membantu meredakan nyeri punggung dengan memperkuat otot-otot penyangga tulang belakang.", "Senam ringan seperti berjalan kaki atau berenang dapat membantu mengurangi pembengkakan pada kaki dengan meningkatkan sirkulasi darah.", "Ya, berolahraga ringan selama kehamilan umumnya aman dan dapat membantu meningkatkan energi Anda. Namun, pastikan untuk mendengarkan tubuh Anda dan istirahat jika merasa lelah.", "Senam hamil dapat menjadi cara yang efektif untuk mengurangi stres dan meningkatkan mood. Gerakan yang lembut dan fokus pada pernapasan dapat membantu Anda rileks.", "Senam hamil yang dilakukan dengan benar dan diawasi oleh instruktur yang berpengalaman tidak akan membahayakan janin Anda. Justru, senam hamil dapat meningkatkan kesehatan ibu dan janin."]
    },
    {
        "tag": "diet",
        "patterns": [ "Makanan apa yang harus aku makan selama kehamilan?", "Apakah aku perlu mengubah dietku selama hamil?", "Bagaimana cara menjaga diet sehat selama hamil?", "Makanan apa yang harus aku hindari saat hamil?", "Berapa kali sehari yang ideal untuk ibu hamil makan?", "Apakah boleh makan pedas saat hamil?", "Saya sering mual saat hamil, makanan apa yang bisa membantu?", "Saya mengalami sembelit, makanan apa yang sebaiknya saya konsumsi?", "Saya cepat lelah, makanan apa yang bisa memberikan energi?", "Saya khawatir kekurangan zat besi selama hamil, makanan apa yang kaya zat besi?"],
        "responses": [ "Fokuslah pada makanan bergizi seperti sayuran, buah-buahan, protein tanpa lemak, dan produk susu. Hindari makanan mentah dan batasi kafein.", "Makanan sehat seperti sayuran, protein, dan karbohidrat kompleks penting untuk perkembangan bayi.", "Pastikan untuk makan dengan seimbang dan menghindari makanan olahan, gula berlebih, dan makanan mentah.", "Idealnya, ibu hamil makan 5-6 kali sehari dengan porsi yang lebih kecil. Ini membantu menjaga kadar gula darah tetap stabil.", "Makanan pedas umumnya aman dikonsumsi selama kehamilan, namun jika menyebabkan ketidaknyamanan seperti heartburn, sebaiknya dihindari.", "Untuk mengatasi mual, coba konsumsi makanan kecil dan sering, hindari makanan berminyak dan berbau tajam, dan perbanyak asupan cairan.", "Untuk mengatasi sembelit, perbanyak konsumsi serat dari buah-buahan, sayuran, dan biji-bijian. Minum air putih yang cukup juga sangat penting.", "Makanan kaya zat besi seperti daging merah, ayam, ikan, kacang-kacangan, dan sayuran berdaun hijau dapat membantu mengatasi kelelahan.", "Makanan kaya zat besi seperti daging merah, ayam, ikan, kacang-kacangan, dan sayuran berdaun hijau sangat penting untuk mencegah anemia selama kehamilan."]
    },
    {
        "tag": "kram_kaki",
        "patterns": [ "Aku sering mengalami kram kaki di malam hari", "Kenapa kakiku sering kram?", "Apa yang harus aku lakukan jika kakiku kram?", "Bagaimana cara mengatasi kram kaki selama hamil?", "Kram kakiku sangat sakit sampai terbangun dari tidur", "Kaki kaku hampir setiap malam, apa penyebabnya?", "Olahraga apa yang aman dilakukan untuk mengurangi kram kaki?", "Posisi tidur seperti apa yang baik untuk mencegah kram kaki?", "Aku kekurangan nutrisi apa ya, kok sering kram?", "Selain minum air putih, apa lagi yang bisa saya lakukan untuk mencegah kram kaki?", "Makanan apa yang baik untuk mengurangi risiko kram kaki?", "Apakah kekurangan kalsium bisa menyebabkan kram kaki?"],
        "responses": [ "Kram kaki sering terjadi selama kehamilan, terutama di malam hari. Cobalah peregangan kaki sebelum tidur dan pastikan kamu cukup minum air.", "Mengangkat kaki saat tidur dan menjaga hidrasi bisa membantu mencegah kram kaki.", "Jika kram terjadi, cobalah untuk berdiri dan menggerakkan kaki atau lakukan pijatan lembut pada area yang terkena.", "Kekurangan magnesium dan kalsium bisa menjadi penyebab umum kram kaki. Cobalah konsumsi makanan kaya magnesium seperti pisang, kacang-kacangan, dan sayuran hijau.", "Selain minum air putih, perbanyak konsumsi makanan yang mengandung kalium seperti pisang, alpukat, dan tomat.", "Yoga prenatal dan peregangan ringan secara teratur dapat membantu mengurangi risiko kram kaki.", "Tidur dengan posisi kaki sedikit ditinggikan menggunakan bantal bisa membantu mengurangi pembengkakan dan mencegah kram.", "Ya, kekurangan kalsium bisa menjadi salah satu penyebab kram kaki. Pastikan kamu mengonsumsi makanan kaya kalsium seperti susu, keju, dan sayuran hijau.", "Selain peregangan, kompres hangat pada area yang kram juga bisa membantu meredakan nyeri."]
    },
    {
        "tag": "sakit_pinggang",
        "patterns": ["Pinggangku terasa sakit sekali", "Apa penyebab sakit pinggang saat hamil?", "Bagaimana cara meredakan sakit pinggang?", "Sakit pinggang ini sangat mengganggu"],
        "responses": ["Sakit pinggang adalah keluhan umum selama kehamilan, disebabkan oleh perubahan hormon dan beban ekstra pada punggung. Cobalah menggunakan bantal pendukung saat duduk atau tidur, dan lakukan peregangan ringan.", "Peregangan, yoga prenatal, dan pijatan ringan bisa membantu meredakan sakit pinggang.", "Jika sakit pinggang semakin parah, sebaiknya konsultasikan dengan dokter untuk mendapatkan penanganan yang tepat."]
    },
    {
        "tag": "mulas",
        "patterns": ["Aku sering merasa mulas setelah makan", "Apa yang menyebabkan mulas saat hamil?", "Bagaimana cara mengatasi mulas?", "Mulas ini sangat mengganggu, apa yang bisa kulakukan?"],
        "responses": ["Mulas sering terjadi karena perubahan hormon yang menyebabkan asam lambung naik. Cobalah makan dalam porsi kecil tetapi sering, dan hindari makanan pedas atau berlemak.", "Mengangkat kepala saat tidur dan menghindari makan dekat dengan waktu tidur bisa membantu mengurangi mulas.", "Jika mulas berlanjut, bicarakan dengan dokter tentang obat yang aman digunakan selama kehamilan."]
    },
    {
        "tag": "varises",
        "patterns": ["Aku melihat ada varises di kakiku", "Bagaimana cara mencegah varises?", "Apakah varises bisa berbahaya?", "Apa yang harus kulakukan dengan varises ini?"],
        "responses": ["Varises umum terjadi selama kehamilan karena peningkatan tekanan pada pembuluh darah. Mengangkat kaki saat duduk dan mengenakan stoking kompresi bisa membantu.", "Cobalah untuk tidak berdiri atau duduk terlalu lama, dan bergeraklah secara teratur untuk mencegah varises.", "Varises biasanya tidak berbahaya, tetapi jika kamu merasa nyeri atau ada pembengkakan yang signifikan, sebaiknya konsultasikan dengan dokter."]
    },
    {
        "tag": "hipertensi",
        "patterns": ["Dokter bilang aku mengalami tekanan darah tinggi", "Apa yang menyebabkan hipertensi selama hamil?", "Bagaimana cara mengontrol tekanan darah selama kehamilan?", "Apakah tekanan darah tinggi berbahaya untuk kehamilanku?"],
        "responses": ["Hipertensi selama kehamilan bisa berisiko, jadi penting untuk memantau tekanan darahmu secara teratur dan mengikuti saran dokter.", "Mengurangi asupan garam, makan makanan sehat, dan menghindari stres bisa membantu mengontrol tekanan darah.", "Jika kamu didiagnosis dengan hipertensi, ikuti petunjuk dokter dengan cermat dan lakukan pemeriksaan rutin untuk memastikan kesehatan kamu dan bayi."]
    },
    {
        "tag": "diabetes_gestasional",
        "patterns": ["Aku didiagnosis dengan diabetes gestasional", "Apa itu diabetes gestasional?", "Bagaimana cara mengelola diabetes selama hamil?", "Apakah diabetes gestasional berbahaya?"],
        "responses": ["Diabetes gestasional adalah kondisi di mana kadar gula darah tinggi selama kehamilan. Mengelola diet dan berolahraga secara teratur dapat membantu menjaga kadar gula darah tetap terkendali.", "Dokter mungkin akan merekomendasikan pemeriksaan gula darah secara rutin dan diet khusus untuk membantu mengelola kondisi ini.", "Dengan pengelolaan yang tepat, banyak ibu hamil dengan diabetes gestasional dapat memiliki kehamilan yang sehat."]
    },
    {
        "tag": "anemia",
        "patterns": ["Aku merasa sangat lemas dan dokter bilang aku anemia", "Apa itu anemia selama kehamilan?", "Bagaimana cara mengatasi anemia saat hamil?", "Apakah anemia berbahaya untuk bayiku?"],
        "responses": ["Anemia terjadi ketika tubuh kekurangan sel darah merah, sering kali disebabkan oleh kekurangan zat besi. Mengonsumsi makanan kaya zat besi seperti daging merah, sayuran hijau, dan suplemen yang direkomendasikan dokter dapat membantu.", "Jika kamu mengalami anemia, penting untuk mematuhi saran dokter dan mungkin perlu mengonsumsi suplemen zat besi.", "Anemia ringan biasanya tidak berbahaya jika ditangani dengan baik, tetapi penting untuk mengikuti petunjuk dokter untuk memastikan kesehatan kamu dan bayi."]
    },
    {
        "tag": "insomnia",
        "patterns": ["Aku sulit tidur belakangan ini", "Kenapa aku sering terbangun di malam hari?", "Apa yang bisa aku lakukan untuk tidur lebih nyenyak?", "Bagaimana cara mengatasi insomnia saat hamil?"],
        "responses": ["Insomnia sering terjadi selama kehamilan, terutama pada trimester ketiga. Cobalah untuk menjaga rutinitas tidur yang konsisten dan hindari kafein sebelum tidur.", "Mandi air hangat atau minum susu hangat sebelum tidur dapat membantu merilekskan tubuh dan membuatmu tidur lebih nyenyak.", "Jika insomnia berlanjut, bicarakan dengan dokter tentang cara-cara aman untuk mengatasi masalah tidur selama kehamilan."]
    },
    {
        "tag": "sakit_kepala",
        "patterns": ["Aku sering sakit kepala selama hamil", "Apa penyebab sakit kepala saat hamil?", "Bagaimana cara mengurangi sakit kepala ini?", "Sakit kepala ini sangat mengganggu, apa yang bisa kulakukan?"],
        "responses": ["Sakit kepala bisa terjadi karena perubahan hormon, stres, atau dehidrasi. Pastikan kamu cukup minum dan istirahat, serta hindari pencetus seperti cahaya terang dan kebisingan.", "Cobalah untuk beristirahat di ruangan yang gelap dan tenang, serta lakukan pernapasan dalam untuk meredakan sakit kepala.", "Jika sakit kepala terus berlanjut atau disertai gejala lain, sebaiknya konsultasikan dengan dokter."]
    },
    {
        "tag": "keputihan",
        "patterns": ["Aku mengalami keputihan lebih banyak dari biasanya", "Apakah keputihan normal selama kehamilan?", "Apa yang menyebabkan keputihan saat hamil?", "Bagaimana cara mengatasi keputihan ini?"],
        "responses": ["Keputihan yang meningkat adalah hal biasa selama kehamilan karena perubahan hormon, tetapi pastikan tidak ada bau atau warna yang tidak normal.", "Jaga area intim tetap bersih dan kering, serta hindari penggunaan produk yang bisa mengiritasi.", "Jika keputihan berwarna atau berbau tidak biasa, segera hubungi dokter untuk memastikan tidak ada infeksi."]
    },
    {
        "tag": "nyeri_payudara",
        "patterns": ["Payudaraku terasa nyeri dan sensitif", "Kenapa payudaraku sakit saat hamil?", "Apakah ini normal jika payudaraku terasa nyeri?", "Bagaimana cara mengurangi nyeri payudara?"],
        "responses": ["Nyeri payudara umum terjadi selama kehamilan akibat perubahan hormon yang mempersiapkan tubuh untuk menyusui. Menggunakan bra yang nyaman dan mendukung bisa membantu mengurangi ketidaknyamanan.", "Pilih bra yang pas dan terbuat dari bahan yang lembut untuk mengurangi tekanan pada payudara.", "Nyeri ini biasanya berkurang setelah trimester pertama, tetapi jika sangat mengganggu, konsultasikan dengan dokter."]
    },
    {
        "tag": "sesak_napas",
        "patterns": ["Aku merasa sulit bernapas", "Kenapa aku sering sesak napas?", "Apakah sesak napas ini normal?", "Bagaimana cara mengatasi sesak napas saat hamil?"],
        "responses": ["Sesak napas bisa terjadi karena rahim yang membesar menekan diafragma, terutama di trimester ketiga. Cobalah duduk atau berdiri dengan posisi tegak untuk membantu pernapasan.", "Lakukan pernapasan dalam dan perlahan saat merasa sesak napas, serta hindari aktivitas berat.", "Jika sesak napas sangat mengganggu atau disertai gejala lain, segera konsultasikan dengan dokter."]
    },
    {
        "tag": "wasir",
        "patterns": ["Aku mengalami wasir selama kehamilan", "Apa penyebab wasir saat hamil?", "Bagaimana cara mengatasi wasir?", "Wasir ini sangat mengganggu, apa yang bisa aku lakukan?"],
        "responses": ["Wasir bisa terjadi karena tekanan pada pembuluh darah di panggul. Minum banyak air, makan makanan berserat tinggi, dan hindari duduk terlalu lama untuk membantu mencegah dan mengatasi wasir.", "Kompres dingin atau mandi air hangat bisa membantu meredakan nyeri akibat wasir.", "Jika wasir sangat mengganggu, bicarakan dengan dokter untuk mendapatkan perawatan yang tepat."]
    },
    {
        "tag": "infeksi_saluran_kemih",
        "patterns": ["Aku merasa sakit saat buang air kecil", "Kenapa aku sering buang air kecil?", "Apakah ini infeksi saluran kemih?", "Bagaimana cara mengatasi infeksi saluran kemih?"],
        "responses": ["Infeksi saluran kemih bisa terjadi selama kehamilan. Jika kamu merasa sakit saat buang air kecil atau sering merasa ingin buang air kecil, segera hubungi dokter.", "Minum banyak air dan pastikan untuk buang air kecil setelah berhubungan intim bisa membantu mencegah infeksi saluran kemih.", "Jika kamu mencurigai infeksi saluran kemih, sebaiknya segera mendapatkan perawatan medis untuk mencegah komplikasi."]
    },
    {
        "tag": "stretch_marks",
        "patterns": ["Kulitku mengalami stretch marks", "Bagaimana cara mencegah stretch marks?", "Apakah stretch marks ini akan hilang?", "Apa yang bisa aku lakukan untuk mengatasi stretch marks?"],
        "responses": ["Stretch marks umum terjadi selama kehamilan karena peregangan kulit. Menggunakan pelembap atau minyak khusus dapat membantu menjaga elastisitas kulit.", "Walaupun stretch marks mungkin tidak sepenuhnya hilang, mereka biasanya memudar seiring waktu.", "Fokus pada menjaga kulit tetap terhidrasi dan berbicara dengan dokter kulit jika kamu ingin mencoba perawatan khusus untuk stretch marks."]
    },
    {
        "tag": "nutrisi_asam_folat",
        "patterns": ["Kenapa asam folat penting selama kehamilan?", "Apa manfaat asam folat untuk bayiku?", "Makanan apa yang mengandung asam folat?", "Berapa banyak asam folat yang harus aku konsumsi?"],
        "responses": ["Asam folat penting untuk mencegah cacat tabung saraf pada bayi dan mendukung perkembangan otak dan sumsum tulang belakang. Konsumsi sayuran hijau, kacang-kacangan, dan sereal yang diperkaya asam folat.", "Asam folat membantu perkembangan sistem saraf bayi yang sehat. Sumber yang baik termasuk bayam, brokoli, kacang-kacangan, dan jeruk.", "Disarankan untuk mengonsumsi 400-800 mikrogram asam folat setiap hari selama kehamilan. Konsultasikan dengan dokter untuk dosis yang tepat."]
    },
    {
        "tag": "nutrisi_zat_besi",
        "patterns": ["Kenapa zat besi penting selama kehamilan?", "Apa manfaat zat besi untuk bayi?", "Makanan apa yang kaya zat besi?", "Bagaimana cara mencegah anemia selama kehamilan?"],
        "responses": ["Zat besi membantu mencegah anemia dan mendukung produksi sel darah merah yang dibutuhkan untuk pertumbuhan bayi. Sumber zat besi termasuk daging merah, bayam, dan kacang-kacangan.", "Zat besi penting untuk mengangkut oksigen ke seluruh tubuh dan ke bayi. Sertakan makanan seperti daging, biji-bijian, dan sayuran hijau dalam dietmu.", "Untuk mencegah anemia, pastikan untuk mengonsumsi makanan kaya zat besi dan, jika diperlukan, suplemen zat besi sesuai rekomendasi dokter."]
    },
    {
        "tag": "nutrisi_kalsium",
        "patterns": ["Kenapa kalsium penting untuk bayi?", "Berapa banyak kalsium yang harus aku konsumsi?", "Makanan apa yang kaya kalsium?", "Apa manfaat kalsium selama kehamilan?"],
        "responses": ["Kalsium penting untuk perkembangan tulang dan gigi bayi. Sumber kalsium termasuk susu, keju, yogurt, dan sayuran berdaun hijau seperti kale dan bok choy.", "Disarankan untuk mengonsumsi sekitar 1.000 mg kalsium per hari selama kehamilan. Produk susu dan sayuran hijau adalah sumber yang baik.", "Kalsium membantu dalam pembentukan tulang yang kuat pada bayi dan menjaga kesehatan tulang ibu selama kehamilan."]
    },
    {
        "tag": "nutrisi_omega_3",
        "patterns": ["Apa manfaat omega-3 untuk bayiku?", "Kenapa omega-3 penting selama kehamilan?", "Makanan apa yang mengandung omega-3?", "Berapa banyak omega-3 yang harus aku konsumsi?"],
        "responses": ["Omega-3 penting untuk perkembangan otak dan mata bayi. Sumber yang baik termasuk ikan berlemak seperti salmon, biji chia, dan kenari.", "Konsumsilah sekitar 200-300 mg DHA, yang merupakan salah satu jenis omega-3, setiap hari. Ikan berlemak dan suplemen DHA adalah pilihan yang baik.", "Omega-3 membantu perkembangan kognitif bayi dan mengurangi risiko kelahiran prematur. Pastikan untuk memasukkan makanan kaya omega-3 dalam dietmu."]
    },
    {
        "tag": "nutrisi_protein",
        "patterns": ["Kenapa protein penting selama kehamilan?", "Berapa banyak protein yang harus aku konsumsi?", "Apa saja makanan kaya protein?", "Bagaimana protein membantu perkembangan bayi?"],
        "responses": ["Protein adalah blok pembangun utama sel dan jaringan, penting untuk pertumbuhan bayi. Konsumsilah sumber protein seperti daging tanpa lemak, ikan, telur, dan kacang-kacangan.", "Disarankan untuk mengonsumsi sekitar 70-100 gram protein setiap hari selama kehamilan untuk mendukung pertumbuhan bayi.", "Protein membantu perkembangan otot, organ, dan sistem kekebalan bayi. Pastikan untuk memasukkan berbagai sumber protein dalam diet harianmu."]
    },
    {
        "tag": "nutrisi_vitamin_D",
        "patterns": ["Kenapa vitamin D penting untuk bayiku?", "Berapa banyak vitamin D yang harus aku konsumsi?", "Apa saja sumber vitamin D?", "Bagaimana vitamin D membantu kehamilan?"],
        "responses": ["Vitamin D penting untuk penyerapan kalsium dan fosfor, yang membantu perkembangan tulang dan gigi bayi. Sumber yang baik termasuk paparan sinar matahari, ikan berlemak, dan susu yang diperkaya.", "Disarankan untuk mengonsumsi 600 IU vitamin D per hari selama kehamilan. Konsultasikan dengan dokter apakah kamu memerlukan suplemen tambahan.", "Vitamin D membantu mencegah masalah tulang seperti rakhitis pada bayi dan menjaga kesehatan tulang ibu."]
    },
    {
        "tag": "nutrisi_serat",
        "patterns": ["Kenapa serat penting selama kehamilan?", "Makanan apa yang kaya serat?", "Bagaimana serat membantu selama kehamilan?", "Berapa banyak serat yang harus aku konsumsi?"],
        "responses": ["Serat membantu pencernaan dan mencegah sembelit yang umum terjadi selama kehamilan. Sumber serat yang baik termasuk buah-buahan, sayuran, biji-bijian, dan kacang-kacangan.", "Disarankan untuk mengonsumsi sekitar 25-30 gram serat setiap hari untuk menjaga kesehatan pencernaan selama kehamilan.", "Serat membantu menjaga berat badan yang sehat, mengontrol gula darah, dan mencegah sembelit selama kehamilan."]
    },
    {
        "tag": "nutrisi_air",
        "patterns": ["Kenapa aku harus minum banyak air selama hamil?", "Berapa banyak air yang harus aku minum?", "Apa manfaat air untuk kehamilan?", "Bagaimana cara memastikan aku cukup minum air?"],
        "responses": ["Air penting untuk menjaga hidrasi, mendukung sirkulasi darah, dan membantu pembentukan cairan ketuban. Disarankan untuk minum setidaknya 8-10 gelas air setiap hari.", "Cukup minum air membantu mencegah dehidrasi, sembelit, dan infeksi saluran kemih selama kehamilan.", "Pastikan untuk minum air sepanjang hari dan bawa botol air ke mana pun kamu pergi untuk memastikan kamu tetap terhidrasi."]
    },
    {
        "tag": "fakta-1",
        "patterns": ["Berikan aku fakta menarik tentang kehamilan", "Apa saja fakta unik tentang kehamilan?", "Aku ingin tahu fakta menarik tentang kehamilan", "Fakta apa yang mungkin belum aku ketahui tentang kehamilan?"],
        "responses": ["Tahukah kamu bahwa selama kehamilan, volume darah dalam tubuh ibu bisa meningkat hingga 50% untuk mendukung bayi yang sedang tumbuh?"]
    },
    {
        "tag": "fakta-2",
        "patterns": ["Ceritakan lebih banyak fakta kehamilan", "Fakta kehamilan lainnya?", "Apa lagi fakta menarik tentang kehamilan?", "Fakta lain tentang kehamilan?"],
        "responses": ["Bayi dalam kandungan bisa mulai mendengar suara dari luar sejak usia 18 minggu, dan mereka bisa mengenali suara ibu mereka."]
    },
    {
        "tag": "fakta-3",
        "patterns": ["Ada fakta unik lainnya tentang kehamilan?", "Berikan aku fakta tentang kehamilan", "Fakta menarik tentang kehamilan lainnya?", "Ada fakta lain tentang kehamilan?"],
        "responses": ["Selama trimester ketiga, bayi bisa mengalami mimpi. Meskipun kita tidak tahu apa yang mereka mimpikan, aktivitas otak mereka menunjukkan pola tidur REM yang terkait dengan mimpi."]
    },
    {
        "tag": "fakta-4",
        "patterns": ["Apa fakta unik tentang bayi dalam kandungan?", "Apa fakta kehamilan lainnya?", "Ceritakan fakta kehamilan lainnya?", "Fakta menarik tentang kehamilan?"],
        "responses": ["Kulit bayi mulai berkembang dan menjadi lebih tebal di trimester kedua. Mereka juga mulai mengembangkan sidik jari unik mereka pada usia kehamilan sekitar 12 minggu."]
    },
    {
        "tag": "fakta-5",
        "patterns": ["Fakta menarik lainnya tentang kehamilan?", "Ada fakta lain tentang bayi dalam kandungan?", "Fakta unik tentang kehamilan?", "Apa fakta kehamilan menarik lainnya?"],
        "responses": ["Bayi dalam kandungan dapat merasakan rasa dari makanan yang dimakan ibu melalui cairan ketuban. Ini berarti bayi bisa mulai mengenali rasa seperti manis atau pedas sebelum mereka lahir!"]
    },
    {
        "tag": "fakta-6",
        "patterns": ["Berikan aku fakta menarik tentang bayi saat hamil", "Apa lagi fakta tentang kehamilan?", "Fakta kehamilan yang tidak biasa?", "Ceritakan fakta menarik tentang kehamilan"],
        "responses": ["Selama kehamilan, plasenta sebenarnya adalah satu-satunya organ sementara yang tubuh manusia buat dan buang. Plasenta bertanggung jawab untuk memberi nutrisi dan oksigen kepada bayi."]
    },
    {
        "tag": "fakta-7",
        "patterns": ["Fakta menarik lainnya tentang kehamilan?", "Apa lagi fakta tentang bayi dalam kandungan?", "Fakta menarik soal kehamilan?", "Ada fakta lain tentang kehamilan?"],
        "responses": ["Bayi dalam kandungan mulai mengembangkan kebiasaan tidur dan bangun sendiri sejak trimester kedua. Mereka bahkan bisa lebih aktif pada malam hari, yang kadang membuat ibu sulit tidur."]
    },
    {
        "tag": "fakta-8",
        "patterns": ["Ceritakan fakta menarik tentang kehamilan?", "Apa fakta unik lainnya tentang kehamilan?", "Fakta kehamilan yang tidak biasa?", "Ada fakta tentang bayi dalam kandungan?"],
        "responses": ["Meskipun jarang terjadi, ada kasus di mana bayi dilahirkan dengan gigi! Ini disebut 'natal teeth' dan terjadi pada sekitar 1 dari 2.000 kelahiran."]
    },
    {
        "tag": "fakta-9",
        "patterns": ["Berikan aku fakta tentang persalinan", "Apa saja fakta menarik tentang persalinan?", "Ceritakan fakta menarik tentang persalinan", "Fakta apa yang mungkin belum aku ketahui tentang persalinan?"],
        "responses": ["Tahukah kamu bahwa kontraksi yang terjadi saat persalinan membantu bayi bergerak melalui jalan lahir dan juga membantu tubuh ibu untuk mulai menyusui dengan memproduksi hormon oksitosin?"]
    },
    {
        "tag": "fakta-10",
        "patterns": ["Apa fakta unik tentang persalinan?", "Fakta persalinan lainnya?", "Apa lagi fakta menarik tentang persalinan?", "Fakta lain tentang persalinan?"],
        "responses": ["Persalinan bisa berlangsung dalam waktu yang bervariasi, dari beberapa jam hingga lebih dari satu hari, terutama bagi ibu yang melahirkan untuk pertama kalinya."]
    },
    {
        "tag": "fakta-11",
        "patterns": ["Ada fakta lain tentang persalinan?", "Fakta unik tentang melahirkan?", "Ceritakan fakta tentang persalinan", "Fakta menarik tentang persalinan lainnya?"],
        "responses": ["Sebagian besar wanita melahirkan pada minggu ke-39 hingga 41, tetapi hanya sekitar 5% bayi yang lahir tepat pada tanggal perkiraan lahir."]
    },
    {
        "tag": "fakta-12",
        "patterns": ["Berikan fakta menarik tentang melahirkan", "Apa fakta persalinan yang tidak biasa?", "Ada fakta menarik tentang persalinan?", "Ceritakan lebih banyak fakta tentang melahirkan"],
        "responses": ["Melahirkan dalam air menjadi semakin populer karena beberapa ibu merasa lebih nyaman dan rileks, yang dapat membantu mengurangi rasa sakit selama persalinan."]
    },
    {
        "tag": "fakta-13",
        "patterns": ["Apa lagi fakta menarik tentang persalinan?", "Fakta tentang melahirkan?", "Ceritakan fakta tentang persalinan lainnya?", "Fakta unik tentang melahirkan?"],
        "responses": ["Plasenta, yang memberi nutrisi pada bayi selama kehamilan, juga lahir setelah bayi lahir. Ini dikenal sebagai tahap ketiga persalinan."]
    },
    {
        "tag": "fakta-14",
        "patterns": ["Fakta menarik lainnya tentang persalinan?", "Apa fakta unik tentang persalinan?", "Ada lagi fakta tentang melahirkan?", "Fakta menarik tentang proses melahirkan?"],
        "responses": ["Beberapa wanita mengalami apa yang disebut 'persalinan fantom', di mana mereka merasakan kontraksi mirip persalinan beberapa minggu sebelum waktu persalinan yang sebenarnya. Ini biasanya merupakan tanda bahwa tubuh sedang mempersiapkan diri."]
    },
    {
        "tag": "fakta-15",
        "patterns": ["Apa fakta persalinan lainnya?", "Ceritakan fakta tentang melahirkan", "Fakta menarik tentang persalinan?", "Fakta unik tentang proses melahirkan?"],
        "responses": ["Bayi yang lahir dengan operasi caesar mungkin memiliki kepala yang lebih bulat dibandingkan bayi yang lahir normal, karena mereka tidak melewati tekanan di jalan lahir."]
    },
    {
        "tag": "fakta-16",
        "patterns": ["Fakta persalinan yang tidak biasa?", "Ada fakta lain tentang melahirkan?", "Ceritakan lebih banyak fakta tentang persalinan", "Fakta menarik tentang proses melahirkan lainnya?"],
        "responses": ["Dalam beberapa kasus, tali pusar dapat melilit leher bayi saat lahir. Ini biasanya tidak berbahaya dan dapat diatasi dengan segera oleh dokter atau bidan."]
    }
]}