{
  "_name_or_path": "indolem/indobert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_ids": 0,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "sapaan",
    "1": "pagi",
    "2": "siang",
    "3": "sore",
    "4": "malam",
    "5": "perpisahan",
    "6": "terima-kasih",
    "7": "tidak-merespon",
    "8": "respon-netral",
    "9": "tentang",
    "10": "skill",
    "11": "pembuat",
    "12": "nama",
    "13": "bantuan",
    "14": "senang",
    "15": "kasual",
    "16": "selesai",
    "17": "candaan",
    "18": "khawatir",
    "19": "nyeri",
    "20": "mual",
    "21": "senam hamil",
    "22": "diet",
    "23": "kram_kaki",
    "24": "sakit_pinggang",
    "25": "mulas",
    "26": "varises",
    "27": "hipertensi",
    "28": "diabetes_gestasional",
    "29": "anemia",
    "30": "insomnia",
    "31": "sakit_kepala",
    "32": "keputihan",
    "33": "nyeri_payudara",
    "34": "sesak_napas",
    "35": "wasir",
    "36": "infeksi_saluran_kemih",
    "37": "stretch_marks",
    "38": "nutrisi_asam_folat",
    "39": "nutrisi_zat_besi",
    "40": "nutrisi_kalsium",
    "41": "nutrisi_omega_3",
    "42": "nutrisi_protein",
    "43": "nutrisi_vitamin_D",
    "44": "nutrisi_serat",
    "45": "nutrisi_air",
    "46": "fakta-1",
    "47": "fakta-2",
    "48": "fakta-3",
    "49": "fakta-4",
    "50": "fakta-5",
    "51": "fakta-6",
    "52": "fakta-7",
    "53": "fakta-8",
    "54": "fakta-9",
    "55": "fakta-10",
    "56": "fakta-11",
    "57": "fakta-12",
    "58": "fakta-13",
    "59": "fakta-14",
    "60": "fakta-15",
    "61": "fakta-16"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "anemia": 29,
    "bantuan": 13,
    "candaan": 17,
    "diabetes_gestasional": 28,
    "diet": 22,
    "fakta-1": 46,
    "fakta-10": 55,
    "fakta-11": 56,
    "fakta-12": 57,
    "fakta-13": 58,
    "fakta-14": 59,
    "fakta-15": 60,
    "fakta-16": 61,
    "fakta-2": 47,
    "fakta-3": 48,
    "fakta-4": 49,
    "fakta-5": 50,
    "fakta-6": 51,
    "fakta-7": 52,
    "fakta-8": 53,
    "fakta-9": 54,
    "hipertensi": 27,
    "infeksi_saluran_kemih": 36,
    "insomnia": 30,
    "kasual": 15,
    "keputihan": 32,
    "khawatir": 18,
    "kram_kaki": 23,
    "malam": 4,
    "mual": 20,
    "mulas": 25,
    "nama": 12,
    "nutrisi_air": 45,
    "nutrisi_asam_folat": 38,
    "nutrisi_kalsium": 40,
    "nutrisi_omega_3": 41,
    "nutrisi_protein": 42,
    "nutrisi_serat": 44,
    "nutrisi_vitamin_D": 43,
    "nutrisi_zat_besi": 39,
    "nyeri": 19,
    "nyeri_payudara": 33,
    "pagi": 1,
    "pembuat": 11,
    "perpisahan": 5,
    "respon-netral": 8,
    "sakit_kepala": 31,
    "sakit_pinggang": 24,
    "sapaan": 0,
    "selesai": 16,
    "senam hamil": 21,
    "senang": 14,
    "sesak_napas": 34,
    "siang": 2,
    "skill": 10,
    "sore": 3,
    "stretch_marks": 37,
    "tentang": 9,
    "terima-kasih": 6,
    "tidak-merespon": 7,
    "varises": 26,
    "wasir": 35
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.42.4",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 31923
}
